In [1]:
import pandas as pd

In [2]:
import pandas as pd
dict1 = {'Name':['Priyang', 'Aadyha', 'Krisha', 'Vedant', 'Parshv', 'Mittal', 'Archana'],
         'Marks': [98, 89, 99, 87, 90, 83, 99],
         'Gender': ['Male', 'Female', 'Female', 'Male', 'Male', 'Female', 'Female']
         }

df1 = pd.DataFrame(dict1)

df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadyha     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [3]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadyha     89  Female
2   Krisha     99  Female

In [4]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
df1.shape

(7, 3)

In [7]:
print('Number of Rows', df1.shape[0])
print('Number of Columns', df1.shape[1])

Number of Rows 7
Number of Columns 3

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes